let quotes = [
    [
        "Благородные люди, друг друга любя,      \
        Видят горе других, забывают себя.        \
        Если чести и блеска зеркал ты желаешь, — \
        Не завидуй другим, — и возлюбят тебя.",

        "&copy; Омар Хайям"
    ],

    [
        "Добродетель мудрецов напоминает собой путешествие в дальннюю страну \
        и восхождение на вершину: идущие                                     \
        в дальнюю страну начинают свой путь с первого шага;                  \
        восходящие на вершину начинают с подножия горы.",

        "&copy; Конфуций"
    ],

    [
        "Если вы хотите успеха, а готовитесь к поражению, то вы получите как раз то, к чему готовитесь.",

        "&copy; Флоренс Шин"
    ],

    [
        "Мы – рабы своих привычек. измени свои привычки, изменится твоя жизнь.",

        "&copy; Роберт Кийосаки"
    ]
];