let facts = [
  {
    fact: "Понад 100 тисяч українських програмістів працюють у провідних IT-компаніях",
    source:
      "На це не впливає ані нестабільна політична, ані економічна ситуації. Слід зазначити, що ця цифра щодня зростає і може сягати 200 тисяч у 2020 році. Такий темп є одним з найшвидших у Європі. Найбільше наших фахівців у США, слідом йде Європа та Ізраїль.",
  },
  {
    fact: "Ні для кого не буде таємницею, що фахівці IT-сфери отримують чималенькі зарплати",
    source:
      "В середньому український програміст, який працює на Батьківщині, може отримувати від 400 до 4000 “вічнозелених”. Все залежить від рівня знань ITшника та вмінь, якими він володіє. Але й такі суми – це далеко не межа. До прикладу, в Штатах можна заробити в середньому від 5 до 10 тисяч доларів. На такі ж гроші можуть претендувати програмісти в Канаді.",
  },
  {
    fact: "Львів – IT-столиця України",
    source:
      "Не так давно про Львів почали говорити не тільки як про культурну столицю, а й як про осередок ITшників. Воно й не дивно, адже саме у Львові стрімкими темпами збільшується кількість програмістів. Викликаний цей ріст високою популярністю професії, хорошою навчально-освітньою базою, а також близькістю до європейського ринку праці. Зокрема, у Львові в сфері IT задіяні близько 12 тисяч осіб.",
  },
  {
    fact: "100 тисяч євро інвестицій",
    source:
      "Саме таку суму отримав український IT-проект Roopor. Серед шести тисяч команд-учасників, український сервіс живих аудіотрансляцій увійшов у ТОП-90 переможців. Roopor став єдиним переможцем серед країн СНД і Східної Європи. Сервіс Roopor, створений у 2016 році рекламним агентством Yarche, дає можливість одним кліком вести живі аудіотрансляції. І це не єдиний за останні роки приклад перемоги українців.",
  },
  {
    fact: "WhatsApp родом з України",
    source:
      "Творець популярного у світі месенджера в дитинстві жив дуже бідно і був вимушений переїхати разом із своєю сім’єю до Штатів, де і прославився. Ян Кум самотужки починав опановувати програмування. У 2009 році світ побачив месенджер WhatsApp, який на початках абсолютно ніхто не завантажував. Ян вже розмірковував над тим, щоб покинути цей проект. Його врятувала компанія Apple, яка впровадила функцію push-повідомлень в iOS. Ян Кум додав цю функцію у свій месенджер і лише після цього він набув популярності. Замість кількох сотень завантажень програму додали до своїх пристроїв більше чверті мільйона користувачів. У 2014 році Facebook викупив розробку українського програміста за 16 млрд доларів і зробив його своїм виконавчим директором. На той момент WhatsApp’ом користувалось вже півмільярда людей, а Янові статки сягали понад 9 мільярдів доларів.",
  },
  {
    fact: "Технологію розпізнавання обличчя комп’ютером розробляли українці",
    source:
      "Зокрема киянин Єгор Анчішкін. Ним навіть була створена навіть ціла дослідницька фірма, яка успішно вчила електронний мозок розпізнавати фото та відеоконтент. Проте, подальшого розвитку починання Єгора не отримало, оскільки гігант IT та інтернет-індустрії Google викупив усі перспективні розробки в цій галузі.",
  },
  {
    fact: "У 1951 році у Феофанії, під Києвом, Сергій Лєбєдєв та його команда створили один з перших у Європі цифрових комп’ютерів",
    source:
      "Мала електронна обчислювальна машина займала 60 м2 і працювала з небаченою на той час швидкістю – 3000 операцій за хвилину. МЕОМ навіть здавала іспити комісії Академії Наук, бо машинному інтелекту не довіряли.Позмагатися із потужністю МЕОМ могли лише комп’ютери IBM, які виготовляти у США",
  },
  {
    fact: "Головний кібернетик України Віктор Глушков у 1964 році створив електронну систему обміну економічною інформацією",
    source:
      "Система могла стати першою всесвітньою павутиною, якби не бунт радянських лідерів.",
  },
  {
    fact: "Першу мову програмування для комп’ютера створила українка Катерина Ющенко",
    source:
      "Вона розробила її у 1955 році і назвала адресною. Завдяки їй можна було писати програми, які не залежали від місця у пам’яті комп’ютера. Мови програмування Fortran, Cobol і Algol з’явилися на кілька років пізніше.",
  },
  {
    fact: "Кожного року українська IT-індустрія росте на 20%",
    source:
      "За даними Upwork, в України – третє місце у світі за кількістю кваліфікованих технологів та ІТ-спеціалістів.",
  },
  {
    fact: "Grammarly",
    source:
      "Компанію заснували у 2009 році українці Макс Литвин, Алекс Шевченко та Дмитро Лідер. Зараз Grammarly налічує понад 500 співробітників з офісами у Києві, Нью-Йорку, Ванкувері та Сан-Франциско. З 2020 року Forbes щорічно включає Grammarly в Cloud 100 — рейтинг найкращих компаній, що працюють із хмарними технологіями.",
  },
  {
    fact: "PetCube",
    source:
      "Компанія Petcube, заснована у 2012 році у Києві Ярославом Ажнюком, Андрієм Кленом та Олександром Нескіним, створює сучасні гаджети для домашніх тварин. WiFi-камери з голосовим управлінням, лазерною указкою для ігор та дозатором ласощів допомагають власникам залишатися на зв'язку зі своїми улюбленцями в будь-який час.",
  },
  {
    fact: "MacPaw",
    source:
      "MacPaw — українська компанія, яка створює програми для macOS та iOS. Її заснував у 2008 році Олександр Косован під час навчання у Київському політехнічному інституті. Код для основного продукту — CleanMyMac — Олександр писав, живучи в гуртожитку та працюючи на трьох роботах.",
  },
  {
    fact: "Preply",
    source:
      "Сервіс заснували у 2012 році українські підприємці Кирило Бігай, Дмитро Волошин та Сергій Лук'янов. Стартап спочатку орієнтувався на ринки України та близького закордоння, але з роками зосередився на розвитку в Європі та США. Preply стверджує, що з такими клієнтами, як Bytedance (TikTok), Mercedes та McKinsey, кількість людей, які навчаються на платформі, тепер перевищує кількість студентів Ліги плюща. Платформа прагне домінувати на ринку онлайн-вивчення мови, який до 2025 року досягне $47 млрд.",
  },
  {
    fact: "Looksery (Snap Inc)",
    source:
      "Looksery — український стартап, який заснували в Одесі у 2013 році Віктор Шабуров та Юрій Монастиршин. У вересні 2015 року Snapchat купив Looksery за $150 млн, що на той момент було найбільшою угодою в історії українських стартапів. Згодом фільтри та маски зробили мініреволюцію у світі соцмереж, ставши невід'ємною частиною більшості з них, та еволюціонували в окремий AR-напрямок.",
  },
  {
    fact: "RefaceAI",
    source:
      "Reface — це додаток на базі штучного інтелекту, в якому можна змінювати обличчя у відео, GIF-файлах та зображеннях лише за декілька секунд. У 2020 році Reface став першим AI-додатком з України, який посів 1 місце в топі американського AppStore, випередивши TikTok, Netflix та Amazon. Крім того, його назвали «Додатком року-2020» у Google Play. Станом на грудень 2021 року, Reface встановили 180 млн разів, а його користувачі створили понад 4 млрд одиниць контенту.",
  },
  {
    fact: "Restream",
    source:
      "Стартап заснували у 2014 році українські розробники Олександр Худа та Андрій Суржинський. Офіси компанії розташовані в Остіні (США) та Києві. Платформа задумувалась як сервіс для геймерів та стримерів, але згодом стала повноцінним маркетинговим інструментом для бізнесу.",
  },
  {
    fact: "GitLab",
    source:
      "Сервіс із відкритим вихідним кодом було створено харківськими розробниками Дмитром Запорожцем та Валерієм Сизовим у 2011 та першочергово для власних потреб. GitLab швидко став популярним серед девелоперів і до 2013 року працював за вільною ліцензією.",
  },
  {
    fact: "Ajax Systems",
    source:
      "Ajax Systems — виробник систем безпеки з функціями розумного будинку, що працюють на базі інтелектуальних датчиків. Компанія заснована Олександром Конотопським у 2011 році та базується у Києві. Ajax Systems самостійно розробляє дизайн, апаратне та програмне забезпечення, підтримує власний хмарний сервер та використовує свої протоколи шифрування.",
  },
  {
    fact: "Readdle",
    source:
      "Readdle — це український стартап, який розробляє додатки для екосистеми Apple. Його у 2007 році заснували четверо одеситів — Ігор Жаданов, який нині є CEO Readdle, Олександр Тягульський, Андріан Буданцов та Дмитро Процеров. Readdle розробляє два додатки-сервіси — це інноваційна пошта для бізнесу Spark та Fluix — платформа, що допомагає краще керувати документами з телефону. А також 6 класичних застосунків — PDF Expert, який виграв титул «App of the Year Award» від Apple, а також Scanner Pro, Calendars 5, Documents, Printer Pro, PDF Converter.",
  },
  {
    fact: "Ambisafe",
    source:
      "Українська компанія Ambisafe розробила блокчейн-платформу для емісії токенів та проведення ICO. Крім того, українські розробники активно працюють над розширенням функціональності Ethereum та інших блокчейн-платформ.",
  },
  {
    fact: "Agile Development",
    source: `Концепція "Agile Development" була сформульована в 2001 році українцем Олегом Бартендером та іншими представниками програмістської громади під час проведення Agile Manifesto. Цей підхід змінив спосіб розробки програмного забезпечення, ставши популярним у всьому світі. Agile Development є підхідом до управління та розробки програмного забезпечення, який покликаний забезпечити гнучкість, колаборацію та швидкість у процесі розробки.`,
  },
  {
    fact: "GitHub",
    source:
      "Репозиторій відкритого програмного забезпечення GitHub, який зареєстрований багатьма програмістами для зберігання та спільної роботи над проектами, був створений у 2008 році Джеком Палмером та його командою. Зараз GitHub є найпопулярнішою платформою для спільної розробки програмного забезпечення.",
  },
  {
    fact: "Git",
    source:
      "Серед розробників програмного забезпечення широко використовується система контролю версій Git, розроблена Лінусом Торвальдсом. Вона дозволяє відстежувати зміни в коді, спільно працювати над проектами та легко відновлювати попередні версії програмного забезпечення.",
  },
  {
    fact: "Linux",
    source:
      "Лінус Торвальдс є творцем відкритої операційної системи Linux, яка стала однією з найпопулярніших і найбільш впливових ОС у світі. Він почав розробку Linux у 1991 році і з тих пір вона стала основою для безлічі інших проектів та дистрибутивів.",
  },
  {
    fact: "JavaScript",
    source:
      "Брендан Айк (Brendan Eich) розробив мову програмування JavaScript. Вона була створена для підвищення взаємодії веб-сторінок та додана до першого браузера Netscape Navigator у 1995 році. JavaScript став одним з найпопулярніших і найважливіших мов програмування для веб-розробки.",
  },
  {
    fact: "Google",
    source:
      "Ларрі Пейдж та Сергій Брін заснували компанію Google у 1998 році. Вони розробили пошукову систему, яка стала популярною та ефективною. Згодом Google розширила свою діяльність і розробила безліч інших продуктів та сервісів, включаючи Gmail, Google Maps та Android.",
  },
  {
    fact: "Mozilla's Rust",
    source:
      "Брендан Айк (Brendan Eich) розробив мову програмування Mozilla's Rust. Rust є мовою програмування, орієнтованою на безпеку, швидкість та паралельну обробку даних. Вона набуває популярності серед розробників, які цінують надійність і ефективність.",
  },
  {
    fact: "Linux та GNU",
    source:
      "Лінус Торвальдс і Річард Столлман є засновниками відкритих вихідних кодів Linux та GNU відповідно. Обидва ці проекти пропагують концепцію вільного програмного забезпечення та сприяють розвитку відкритих технологій та співпраці розробників з усього світу.",
  },
  {
    fact: "Перший квантовий комп'ютер",
    source:
      "Вересень 2022 року став вирішальним моментом для квантового обчислення, коли компанія IBM здійснила запуск першого квантового комп'ютера з неймовірними 1000 кубітами. Цей прорив в квантових технологіях відкриває шлях до значних можливостей у сфері обчислень, які досі були недосяжні для класичних комп'ютерів.",
  },
  {
    fact: "Перший запрограмований пристрій",
    source:
      "Першим запрограмованим пристроєм прийнято вважати жакардовий ткацький верстат, побудований в 1804 році Жозефом Марі Жаккар. Він здійснив революцію в ткацькій промисловості, надавши можливість програмувати візерунки на тканинах за допомогою перфокарт.",
  },
  {
    fact: "Мова програмування «Ада»",
    source:
      "Першу в історії людства програму для обчислювальної машини написала в 1843 році графиня Ада Августа Лавлейс, дочка великого англійського поета Джорджа Байрона. Ця програма вирішувала рівняння Бернуллі, що виражає закон збереження енергії рухомої рідини. На честь першої програмістки названа універсальна мова програмування «Ада».",
  },
  {
    fact: "Перший програмований електронний комп'ютер ENIAC",
    source:
      "В 1946 року в Америці був запущений перший у світі реально програмований електронний комп'ютер ENIAC. ENIAC важив 30 тонн і складався з 18 тисяч електронних ламп. ENIAC у порівнянні з сучасним ПК був просто черепахою - його швидкодія було всього 5000 операцій в секунду. Комп'ютер пропрацював дев'ять років до 1955 року. До нього в світі існували і більш ранні моделі комп'ютерів, але всі вони були експериментальними варіантами не отримали практичного використання.",
  },
  {
    fact: "День програміста",
    source:
      "День програміста святкується в 256 день року (13 вересня, у високосний рік – 12 вересня). Вибір числа 256 не випадковий – воно виходить від виведення двійки у восьму ступінь. Саме таку кількість чисел можна виразити за допомогою одного восьмирозрядного байта.",
  },
  {
    fact: "Перший комп'ютер в Європі",
    source:
      "Перший в континентальній Європі комп’ютер було створено в Україні в 1951 году. Перша ЕОМ називалась Малою електронною обчислюванною машиною. Вона нараховувала 6000 електронних ламп та ледь вмістилась в лівому крилі гуртожитку в селещі Феофанія, що в 10 км від Києва. Машина була побудована в лабораторії обчислюваної техніки Інституту електротехніки АН УРСР під керівництвом академіка С.О.Лебедєва.",
  },
  {
    fact: "Python використовують в Google та NASA",
    source:
      "NASA використовує Python в проектах, що стосується математичних розрахунків параметрів польоту. Python визнана офіційною мовою в Google, вона є однією з ключових мов сьогодні в Google, поряд з С, C ++ і Java. Python працює на багатьох внутрішніх системах Google і відображається у багатьох API Google. Python ідеально підходить для інженерного процесу в Google.",
  },
  {
    fact: "Покровитель інтернету",
    source:
      "У Інтернету є власний святий покровитель – Ісідор Севільський. І усе це завдяки Папі Римському Іоанну Павлу ІІ.",
  },
  {
    fact: "Мова Кобол",
    source:
      "У 1959 році була випущена мова Кобол, на якій в основному писали програми для бізнесу. У 1997 році на цій мові оброблялося близько 90 % фінансових транзакцій у світі і 75% комерційних транзакцій.",
  },
  {
    fact: "С++",
    source:
      "У 1983 році данський програміст Бйорн Страуструп створив С++. За допомогою цієї мови створюються операційні системи, ігри, різні додатки, драйвера пристроїв. Гра World of Tanks, Minecraft, Tankionline написані на мові С++.",
  },
];
