let jokes = [
  {
    joke: "Раніше бабусі просили онуків просилити нитку в голку, а в майбутньому проситимуть увести капчу.",
  },
  {
    joke: "Будь ласка, не виганяйте студентів з Гарварда. Дайте їм доучитися! А то вони потім Wіndоws роблять.",
  },
  {
    joke: "Для догляду за літнім програмістом потрібна приємна жінка, що говорить на JАVА, LІSР і С++.",
  },
  {
    joke: "Переїхав програміст із України в Північну Америку. Надсилає своїм родичам звідти посилку. Родичі здивувались – він зазвичай тільки на Новий Рік посилки шле, а тут до Нового Року ще 2 місяці, та й посилка ще в такій коробці, що може слона вмістити. Відкривають коробку, вона виявляється всередині пуста, тільки на самому дні якийсь папірець лежить. Дістають вони її й бачать, що на тому папірці написано: Теst.",
  },
  {
    joke: "Не компілюй мені мізки!",
  },
  {
    joke: "Якби я не був програмістом, я б, напевне, став би хірургом: люблю, знаєте, покопирсатись у різній незрозумілій балабурді.",
  },
  {
    joke: "М'язова пам'ять — це коли сторінка ще не завантажилася, а ти вже поставив мишку на те місце, куди треба клацнути.",
  },
  {
    joke: "Немає неприступних жінок... Є різні рівні доступу!",
  },
  {
    joke: "Їдуть два програмісти в тролейбусі, доїздять до кінцевої. Водій відчиняє передні двері й починає перевіряти квитки. Перший програміст: — Уперше бачу, що драйвер може працювати контролером!",
  },
  {
    joke: "Чим відрізняється закінчений програміст від простого користувача? Користувач думає, що в кілобайті 1000 байт, а Програміст думає, що в кілометрі 1024 метри.",
  },
  {
    joke: "Коли комп’ютери були великими — програми були маленькими.",
  },
  {
    joke: "Заходить програміст у ліфт, йому треба їхати на 12 поверх. Натискає 1, потім 2 і починає гарячково шукати Еntеr.",
  },
  {
    joke: "Робота програміста й шамана має багато загального: обоє бурмочуть незрозумілі слова, обоє роблять незрозумілі дії й обоє не можуть пояснити, як це працює!",
  },
  {
    joke: "Питання: Скільки програмістів потрібно, щоб закрутити лампочку? Жодного. Це апаратна проблема, яка не стосується програмістів.",
  },
  {
    joke: "Одного разу молодий сисадмін познайомився з веб-дизайнершею. За звичкою він відразу ж запитав, яка у неї ір-адреса, але почувши, що ір-адреса у неї динамічна, тут же втратив до неї будь-який інтерес.",
  },
  {
    joke: "Важко бути програмістом. Приходиш відпочити до людей в гості, а тобі відразу показують домашній комп'ютер і просять розібратися з його проблемами. Уявляю, як важко приходиться проктологам...",
  },
  {
    joke: "Справжній програміст, як відомо, ставить на ніч поруч із собою дві склянки — одну з водою на випадок, якщо він захоче пити, а другу без води на випадок, якщо не захоче. А от справжній адмін ставить чотири склянки. Другі дві — на випадок відмови першої системи.",
  },
  {
    joke: "Швидкісний Інтернет – це коли файл простіше знову витягнути, ніж знайти його на жорсткому дискові.",
  },
  {
    joke: "Штирліц сидів дома. З вікна дуло. Штирліц натиснув Аlt+F4 — вікно зникло.",
  },
  {
    joke: "Програміст після напруженого трудового дня заглядає в холодильник, бере пачку масла, читає на обгортці: Масло вершкове. 72%. У голові майнула думка: О! Незабаром завантажиться! Повертає масло в холодильник. Зачиняє двері.",
  },
  {
    joke: "Вирішив зайнятися спортом. Вибрав біг. Добіг до комп'ютера. Сиджу. Бігаю очима по монітору. Я прямо відчуваю: Спорт — це моє!",
  },
  {
    joke: "Існує звичай, що коли одружуються два програмісти, тещею вважається материнська плата комп’ютера жінки.",
  },
  {
    joke: "Більшість користувачів упевнена, що якщо при завантаженні Wіndоws водити курсором по кругу, то комп'ютер завантажиться швидше.",
  },
  {
    joke: "Із комбінації лінощів і логіки виходять програмісти.",
  },
  {
    joke: "Терміново потрібен хакер з великим досвідом! Резюме залишати на робочому столі комп'ютера нашого директора.",
  },
  {
    joke: "Програміст — компіляція ліні та логіки.",
  },
];
